Pipe Flow Validation/Linux Files/base_case/0/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet   { type cyclic; }
    outlet  { type cyclic; }
    wall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    front   { type wedge; }
    back    { type wedge; }
    axis    { type empty; }
}
